<a href="https://colab.research.google.com/github/jose-luis15/python-en-ArcGis/blob/master/CHRISTIAN_EJERCICIOS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [45]:
t = ["deportivo","casual","elegante"]
p = [50,60,70]
precios = pd.DataFrame({"TIPO":t,"PRECIO":p})
precios

        TIPO  PRECIO
0  deportivo      50
1     casual      60
2   elegante      70

In [46]:
c = ["1-10","11-16","17 a mas"]
d = [3,5,7]
descuento = pd.DataFrame({"CANTIDAD":c,"DESCUENTO(%)":d})
descuento

   CANTIDAD  DESCUENTO(%)
0      1-10             3
1     11-16             5
2  17 a mas             7

In [47]:
tipo = input("INGRESE EL TIPO DE PRENDA: ")
cantidad = int(input("INGRESE LA CANTIDAD DE PRENDAS: "))

INGRESE EL TIPO DE PRENDA: casual
INGRESE LA CANTIDAD DE PRENDAS: 12

In [50]:
lar = precios[(precios["TIPO"] == tipo)]
lar = int(lar.iloc[:,-1])
preciof = lar*cantidad
print("Precio final: s/.",preciof )

if 1<=cantidad<=10 :
     desc = 3*preciof/100
elif 11<=cantidad<=16 :
     desc = 5*preciof/100
elif 17<=cantidad :
     desc = 7*preciof/100
print("descuento: s/.",desc)

print("CANCELAR: S/.",preciof -desc)

Precio final: s/. 720
descuento: s/. 36.0
CANCELAR: S/. 684.0

In [0]:
#EJERCICIO N°7

In [18]:
P = ["17-20","14-16","12-13","0-11"]
C = ["A","B","C","D"]
categoria = pd.DataFrame({"PROMEDIO":P,"CATEGORIA":C})
categoria

  PROMEDIO CATEGORIA
0    17-20         A
1    14-16         B
2    12-13         C
3     0-11         D

In [20]:
print("INGRESE SUS NOTAS SEPARADAS POR COMAS(Ejemplo : 12,14,10,9)")
notas = input()
notas = notas.split(",")

suma = 0
for x in notas:
  suma += float(x)
promedio = suma/len(notas)
print("PROMEDIO =",promedio)

if 0<=promedio<=11 :
     categoria = "D"
elif 12<=promedio<=13 :
     categoria = "C"
elif 14<=promedio<=16 :
     categoria = "B"
elif 17<=promedio<=20 :
     categoria = "A"
print("CATEGORIA: ",categoria)

INGRESE SUS NOTAS SEPARADAS POR COMAS(Ejemplo : 12,14,10,9)
12,13,17
PROMEDIO = 14.0
CATEGORIA:  B

In [0]:
#EJERCICO 8

In [21]:
facultad = ["FACULTAD DE INGENIERIA","FACULTAD DE CIENCIAS MATEMATICAS","FACULTAD DE DERECHO","FACULTAD DE CIENCIAS ADMINISTRATIVAS"]
mat = [1000,900,800,600]
men = [2500,1800,2000,2000]
categoria = pd.DataFrame({"FACULTAD":facultad,"MATRICULA":mat,"MENSUALIDAD":men})
categoria

ERROR! Session/line number was not unique in

                               FACULTAD  MATRICULA  MENSUALIDAD
0                FACULTAD DE INGENIERIA       1000         2500
1      FACULTAD DE CIENCIAS MATEMATICAS        900         1800
2                   FACULTAD DE DERECHO        800         2000
3  FACULTAD DE CIENCIAS ADMINISTRATIVAS        600         2000

 database. History logging moved to new session 63

In [43]:
postulado = input("NOMBRE DEL POSTULADO: ")
facu = input("NOMBRE DE LA FACULTAD: ")
lor = categoria[(categoria["FACULTAD"] == facu)]
print()
print(lor)

monto = int(lor.iloc[:,1])+int(lor.iloc[:,2])
print()
print("MONTO A PAGAR; S/.",monto)

NOMBRE DEL POSTULADO: jose
NOMBRE DE LA FACULTAD: FACULTAD DE INGENIERIA

                 FACULTAD  MATRICULA  MENSUALIDAD
0  FACULTAD DE INGENIERIA       1000         2500

MONTO A PAGAR; S/. 3500

In [0]:
#EJERCICO 9

In [51]:
marca = ["D'Onofrio","Motta","Todinno","Naval","Santa Claus","Doña Pepa"]
precio = [20,19,18,9,11,10]
paneton = pd.DataFrame({"MARCA DEL PANETON":marca,"PRECIO UNITARIO":precio})
paneton

  MARCA DEL PANETON  PRECIO UNITARIO
0         D'Onofrio               20
1             Motta               19
2           Todinno               18
3             Naval                9
4       Santa Claus               11
5         Doña Pepa               10

In [55]:
N = input("CLIENTE: ")
M = input("MARCA: ")
C = int(input("CANTIDAD: "))
print()

lir = paneton[(paneton["MARCA DEL PANETON"]==M)]
print(lir)

print()
if 20<=C:
  descuento = (C*int(lir.iloc[:,-1])) /10
  print("DESCUENTO = S/.", descuento)
  monto = (90*C*int(lir.iloc[:,-1])) /100
else:
  monto = C*int(lir.iloc[:,-1])

print("MONTO A PAGAR = S/.",monto)

CLIENTE: Jose
MARCA: Doña Pepa
CANTIDAD: 25

  MARCA DEL PANETON  PRECIO UNITARIO
5         Doña Pepa               10

DESCUENTO = S/. 25.0
MONTO A PAGAR = S/. 225.0